# CSV Files

#### Note: Need to know exact directory location and correct file name
#### May need passwords or permissions for certain data inputs (SQL database)

In [4]:
import pandas as pd
import numpy as np

In [9]:
df = pd.read_csv("C:\\Users\\Eddie\\Downloads\\UNZIP_FOR_NOTEBOOKS_FINAL\\03-Pandas\\example.csv")

In [10]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [11]:
df.to_csv("C:\\Users\\Eddie\\Downloads\\UNZIP_FOR_NOTEBOOKS_FINAL\\03-Pandas\\newfile.csv", index = False)

In [12]:
new = pd.read_csv("C:\\Users\\Eddie\\Downloads\\UNZIP_FOR_NOTEBOOKS_FINAL\\03-Pandas\\newfile.csv")

In [13]:
new

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

## HTML

In [15]:
url = 'https://en.wikipedia.org/wiki/World_population'

In [16]:
tables = pd.read_html(url)

In [17]:
len(tables)

25

In [19]:
tables[0]

  World population milestones in billions[3] (Worldometers estimates)        \
                                                           Population     1
0                                               Year                   1804
1                                      Years elapsed                      —


      2     3     4     5     6     7     8     9    10
0  1927  1960  1974  1987  1999  2011  2022  2037  2057
1   123    33    14    13    12    12    11    15    20

In [21]:
tables[2]

,#,Most populous countries,2000,2015,2030[A]
0,1,China[B],1270,1376,1416
1,2,India,1053,1311,1528
2,3,United States,283,322,356
3,4,Indonesia,212,258,295
4,5,Pakistan,136,208,245
5,6,Brazil,176,206,228
6,7,Nigeria,123,182,263
7,8,Bangladesh,131,161,186
8,9,Russia,146,146,149
9,10,Mexico,103,127,148
10,NaN,World total,6127,7349,8501
11,Notes: .mw-parser-output .reflist{font-size:90...,Notes: .mw-parser-output .reflist{font-size:90...,Notes: .mw-parser-output .reflist{font-size:90...,Notes: .mw-parser-output .reflist{font-size:90...,Notes: .mw-parser-output .reflist{font-size:90...

In [23]:
world_topten = tables[2]

In [24]:
world_topten = world_topten.drop(11,axis = 0)

In [26]:
world_topten = world_topten.drop('#', axis = 1)

In [28]:
world_topten.columns = ['Country','2000','2015','2030 Est']

In [29]:
world_topten

          Country  2000  2015 2030 Est
0        China[B]  1270  1376     1416
1           India  1053  1311     1528
2   United States   283   322      356
3       Indonesia   212   258      295
4        Pakistan   136   208      245
5          Brazil   176   206      228
6         Nigeria   123   182      263
7      Bangladesh   131   161      186
8          Russia   146   146      149
9          Mexico   103   127      148
10    World total  6127  7349     8501

In [32]:
world_topten.to_csv('sample_table.csv', index = False)

## Excel Files
* Pandas can read and write to excel files
* Pandas can only read and write in raw data, it is not able to read in macros, visualizations, or formulas created inside spreadsheets

In [40]:
df = pd.read_excel("C:\\Users\\Eddie\\Downloads\\UNZIP_FOR_NOTEBOOKS_FINAL\\03-Pandas\\my_excel_file.xlsx", sheet_name = 'First_Sheet')

In [41]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [42]:
wb = pd.ExcelFile("C:\\Users\\Eddie\\Downloads\\UNZIP_FOR_NOTEBOOKS_FINAL\\03-Pandas\\my_excel_file.xlsx")

In [44]:
wb.sheet_names

['First_Sheet']

In [46]:
excel_sheet_dict = pd.read_excel("C:\\Users\\Eddie\\Downloads\\UNZIP_FOR_NOTEBOOKS_FINAL\\03-Pandas\\my_excel_file.xlsx", sheet_name = None)

In [47]:
type(excel_sheet_dict)

dict

In [48]:
excel_sheet_dict.keys()

dict_keys(['First_Sheet'])

In [49]:
excel_sheet_dict['First_Sheet']

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [50]:
our_df = excel_sheet_dict['First_Sheet']

In [51]:
our_df.to_excel('example.xlsx', sheet_name = 'First_Sheet', index = False)

## SQL Databases

In [1]:
from sqlalchemy import create_engine

In [2]:
temp_db = create_engine('sqlite:///:memory:')

In [6]:
df = pd.DataFrame(data = np.random.randint(low = 0, high = 100, size =(4,4)), columns = ['a','b','c','d'])

In [7]:
df.to_sql(name = 'new_table', con = temp_db)

4

In [10]:
new_df = pd.read_sql(sql = 'new_table', con = temp_db)

In [11]:
new_df

   index   a   b   c   d
0      0  67  35  24  60
1      1  72  88  93  70
2      2  58  58  22   6
3      3  18  57   2  79

In [14]:
results = pd.read_sql_query(sql = 'SELECT a,c FROM new_table', con = temp_db)

In [15]:
results

    a   c
0  67  24
1  72  93
2  58  22
3  18   2